Repository: mohamedredaoumahdi/Bivouac-Atlas
Catalog: lib/l10n/app_*.arb
Languages: ar

# appName
source: Bivouac Atlas
ar: بيفاك أطلس

source: Welcome
ar: مرحباً

source: Next
ar: التالي

source: Previous
ar: السابق

source: Skip
ar: تخطي

source: Get Started
ar: ابدأ

# continueText
source: Continue
ar: متابعة

source: Cancel
ar: إلغاء

source: OK
ar: موافق

source: Close
ar: إغلاق

source: Language
ar: اللغة

source: Change Language
ar: تغيير اللغة

# onboardingTitle1
source: Welcome to Bivouac Atlas
ar: مرحباً بكم في بيفاك أطلس

# onboardingDesc1
source: Discover the authentic beauty of the Atlas Mountains in Morocco's Azilal region.
ar: اكتشفوا الجمال الأصيل لجبال الأطلس في منطقة أزيلال بالمغرب.

# onboardingTitle2
source: Authentic Experiences
ar: تجارب أصيلة

# onboardingDesc2
source: Choose from 10+ unique activities including waterfall hikes, village tours, and traditional cooking.
ar: اختاروا من بين أكثر من 10 أنشطة فريدة تشمل رحلات الشلالات وجولات القرى والطبخ التقليدي.

# onboardingTitle3
source: Traditional Accommodation
ar: إقامة تقليدية

# onboardingDesc3
source: Stay in authentic Berber tents or eco-friendly wooden cabins surrounded by nature.
ar: أقيموا في خيام بربرية أصيلة أو أكواخ خشبية صديقة للبيئة محاطة بالطبيعة.

# onboardingTitle4
source: Sustainable Tourism
ar: سياحة مستدامة

# onboardingDesc4
source: Support local communities while enjoying an eco-friendly adventure in the mountains.
ar: ادعموا المجتمعات المحلية بينما تستمتعون بمغامرة صديقة للبيئة في الجبال.

source: Choose Your Activity
ar: اختر نشاطك

source: Select your adventure
ar: اختر مغامرتك

source: Available Activities
ar: الأنشطة المتاحة

# activitiesDescription
source: Choose the activity that interests you most. Each experience is guided by local experts.
ar: اختر النشاط الذي يثير اهتمامك أكثر. كل تجربة موجهة من قبل خبراء محليين.

source: Tap to select
ar: اضغط للاختيار

source: Confirm Selection
ar: تأكيد الاختيار

source: Price per person
ar: السعر للشخص الواحد

# continueToAccommodation
source: Would you like to continue to select your accommodation?
ar: هل تود المتابعة لاختيار أماكن الإقامة؟

source: Waterfall Hike
ar: رحلة الشلالات

# tajineCooking
source: Tajine Cooking Experience
ar: تجربة طبخ الطاجين

source: Village Tour
ar: جولة القرية

source: Mountain Trekking
ar: الرحلات الجبلية

source: Lake Excursion
ar: رحلة البحيرة

# starGazing
source: Star Gazing Night
ar: ليلة مراقبة النجوم

source: Donkey Ride
ar: ركوب الحمار

source: Handicraft Workshop
ar: ورشة الحرف اليدوية

source: Forest Picnic
ar: نزهة الغابة

source: Cave Exploration
ar: استكشاف الكهوف

# waterfallHikeDesc
source: Guided hike to discover stunning waterfalls around Azilal, with picnic stops and photo opportunities.
ar: رحلة موجهة لاكتشاف الشلالات المذهلة حول أزيلال، مع محطات نزهة وفرص التصوير.

# tajineCookingDesc
source: Learn how to cook a traditional Berber tajine with locals in a cozy outdoor setting.
ar: تعلموا كيفية طبخ الطاجين البربري التقليدي مع السكان المحليين في بيئة خارجية مريحة.

# villageTourDesc
source: Walk through Amazigh villages, meet local artisans, and learn about rural mountain life.
ar: تجولوا في القرى الأمازيغية والتقوا بالحرفيين المحليين وتعلموا عن الحياة الجبلية الريفية.

# mountainTrekkingDesc
source: A medium-level trekking adventure across scenic Atlas Mountain trails, ideal for nature lovers.
ar: مغامرة رحلة متوسطة المستوى عبر مسارات جبال الأطلس الخلابة، مثالية لمحبي الطبيعة.

# lakeExcursionDesc
source: Day trip to the beautiful Bin El Ouidane Lake with optional boat ride and swimming.
ar: رحلة يومية إلى بحيرة بين الويدان الجميلة مع إمكانية ركوب القارب والسباحة.

# starGazingDesc
source: Night activity in the open camp to observe the stars with no light pollution. Includes storytelling and warm drinks.
ar: نشاط ليلي في المخيم المفتوح لمراقبة النجوم دون تلوث ضوئي. يشمل حكايات ومشروبات دافئة.

# donkeyRideDesc
source: Fun and safe ride for kids and adults along nature trails, guided by locals.
ar: رحلة ممتعة وآمنة للأطفال والكبار على طول مسارات الطبيعة، بإرشاد من السكان المحليين.

# handicraftWorkshopDesc
source: Join local women in making rugs, pottery, or baskets using ancestral techniques.
ar: انضموا إلى النساء المحليات في صنع السجاد والفخار أو السلال باستخدام التقنيات الأجدادية.

# forestPicnicDesc
source: A calm picnic in a forested area with hammocks, local snacks, and a chance to relax.
ar: نزهة هادئة في منطقة حرجية مع أراجيح ووجبات خفيفة محلية وفرصة للاسترخاء.

# caveExplorationDesc
source: Light adventure into natural caves of the Atlas Mountains with a local guide.
ar: مغامرة خفيفة في الكهوف الطبيعية لجبال الأطلس مع مرشد محلي.

source: Choose Accommodation
ar: اختر الإقامة

source: Selected Activity
ar: النشاط المختار

source: Cabins
ar: الأكواخ

source: Tents
ar: الخيام

source: per night
ar: في الليلة

source: available
ar: متوفر

# accommodationNotice
source: All accommodations include a fresh local breakfast.
ar: جميع أماكن الإقامة تشمل إفطاراً محلياً طازجاً.

source: Continue with
ar: متابعة مع

source: Selected
ar: مختار

source: Panoramic Cabin
ar: كوخ بانورامي

source: Family Cabin
ar: كوخ عائلي

source: Eco-Nature Cabin
ar: كوخ إيكو-طبيعي

source: Traditional Berber Tent
ar: خيمة بربرية تقليدية

source: Comfort Tent
ar: خيمة مريحة

# panoramicCabinDesc
source: Located on a quiet hill, offering a stunning panoramic view of the mountains and valleys. Ideal for couples and those seeking tranquility.
ar: يقع على تلة هادئة، يوفر إطلالة بانورامية مذهلة على الجبال والوديان. مثالي للأزواج والباحثين عن الهدوء.

# familyCabinDesc
source: Designed for families or groups, equipped with multiple beds and a comfortable seating area.
ar: مصمم للعائلات أو المجموعات، مجهز بأسرة متعددة ومنطقة جلوس مريحة.

# ecoNatureCabinDesc
source: Wooden cabins blending with nature, made from eco-friendly local materials, with a warm, traditional design.
ar: أكواخ خشبية تمتزج مع الطبيعة، مصنوعة من مواد محلية صديقة للبيئة، بتصميم تقليدي دافئ.

# traditionalBerberTentDesc
source: Inspired by Amazigh tents, featuring local furnishings and an authentic traditional atmosphere.
ar: مستوحاة من الخيام الأمازيغية، تتميز بالأثاث المحلي وأجواء تقليدية أصيلة.

# comfortTentDesc
source: Equipped with comfortable pillows and more space, with curtains and light insulation for comfort.
ar: مجهزة بوسائد مريحة ومساحة أكبر، مع ستائر وعزل خفيف للراحة.

source: Complete Booking
ar: إكمال الحجز

source: Booking Summary
ar: ملخص الحجز

source: Choose Trip Type
ar: اختر نوع الرحلة

source: Personal Information
ar: المعلومات الشخصية

source: Stay Details
ar: تفاصيل الإقامة

source: Full Name
ar: الاسم الكامل

source: Email Address
ar: عنوان الإيميل

source: Phone Number
ar: رقم الهاتف

source: Check-in Date
ar: تاريخ الوصول

source: Check-out Date
ar: تاريخ المغادرة

source: Adults
ar: البالغون

source: Children
ar: الأطفال

# specialRequests
source: Special Requests (Optional)
ar: طلبات خاصة (اختيارية)

# specialRequestsHint
source: Any dietary restrictions, accessibility needs, etc.
ar: أي قيود غذائية، احتياجات إمكانية وصول، إلخ.

# completeBookingButton
source: Complete Booking
ar: إكمال الحجز

# termsNotice
source: By completing this booking, you agree to our terms and conditions. A confirmation email will be sent to you shortly after submission.
ar: بإكمال هذا الحجز، فإنك توافق على الشروط والأحكام الخاصة بنا. سيتم إرسال إيميل تأكيد إليك بعد الإرسال مباشرة.

source: Required
ar: مطلوب

# pleaseEnterName
source: Please enter your full name
ar: يرجى إدخال اسمك الكامل

# pleaseEnterEmail
source: Please enter your email
ar: يرجى إدخال إيميلك

# pleaseEnterPhone
source: Please enter your phone number
ar: يرجى إدخال رقم هاتفك

# pleaseEnterValidEmail
source: Please enter a valid email
ar: يرجى إدخال إيميل صحيح

# pleaseSelectTripType
source: Please select a trip type
ar: يرجى اختيار نوع الرحلة

source: Luxury
ar: فاخر

source: Moderate
ar: متوسط

source: Budget
ar: اقتصادي

# luxuryDesc
source: Premium experience with exclusive services, private guides, and luxury amenities
ar: تجربة راقية مع خدمات حصرية ومرشدين خاصين ووسائل راحة فاخرة

# moderateDesc
source: Balanced experience with quality accommodations and guided activities
ar: تجربة متوازنة مع إقامة عالية الجودة وأنشطة موجهة

# budgetDesc
source: Essential experience focusing on core activities and basic comfort
ar: تجربة أساسية تركز على الأنشطة الرئيسية والراحة الأساسية

source: Booking Confirmed!
ar: تم تأكيد الحجز!

# thankYouForBooking
source: Thank you for booking with Bivouac Atlas!
ar: شكراً لكم لحجزكم مع بيفاك أطلس!

# confirmationEmailSent
source: A confirmation email has been sent to your email address. Our team will contact you within 24 hours to finalize the details.
ar: تم إرسال إيميل التأكيد إلى عنوان إيميلكم. سيتواصل معكم فريقنا خلال 24 ساعة لإنهاء التفاصيل.

source: Return to Home
ar: العودة إلى الرئيسية

source: Error
ar: خطأ

source: Success
ar: نجح

source: Loading...
ar: جاري التحميل...

source: No internet connection
ar: لا يوجد اتصال بالإنترنت

source: Try Again
ar: حاول مرة أخرى
